app/Filters/AuthFilter.php


        // Check if token is still active in database (for multiple login control)
        $db = \Config\Database::connect();
        $tokenStatus = $db->table('user_token')
            ->select('status')
            ->where('access_token', $token)
            ->get()
            ->getRowArray();
---
SELECT `status`
FROM `user_token`
WHERE `access_token` = 'eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJ1c2VyX2lkIjoiNDkiLCJyb2xlX2lkIjoiMiIsInNjaG9vbF9pZCI6IjIiLCJ0aW1lc3RhbXAiOjE3NjE4ODkxMTd9.aqPIswFiRoKH3WYUAMVDiqWoO4kzHk-AZ1xbSFudOX8'