app/Controllers/Content.php

SELECT *
FROM `student_assign_content`
WHERE `class_id` = 1368
AND `content_id` = 10842
UPDATE `student_assign_content` SET `start_date` = '2025-10-31', `end_date` = '2025-12-27', `start_time` = '00:00:00', `end_time` = '23:59:00', `status` = 1
WHERE `id` = '1'
---
                    }

                    // Ensure single student_assign_content per class/content
                    $existingAssignment = $db->table('student_assign_content')
                        ->where('class_id', $classId)
                        ->where('content_id', $contentId)
                        ->get()
                        ->getRowArray();

                    if ($existingAssignment) {
                        $db->table('student_assign_content')
                            ->where('id', $existingAssignment['id'])
                            ->update([
                                'start_date' => $startDate,
                                'end_date' => $endDate,
                                'start_time' => $startTime,
                                'end_time' => $endTime,
                                'status' => 1,
                            ]);

INSERT INTO `class_content` (`class_id`, `content_id`, `school_id`, `status`, `all_student`, `release_score`, `auto_review`, `start_date`, `end_date`, `start_time`, `end_time`, `notes`, `downloadable`, `topic_id`, `is_accessible`, `created_by`, `created_date`, `modified_by`, `modified_date`) VALUES (1368, 10842, '2', 1, 1, 0, 0, '2025-10-31', '2025-12-27', '00:00:00', '23:59:00', '', 0, 0, 0, '49', '2025-10-31 06:17:10', '49', '2025-10-31 06:17:10')
---
                            ->where('id', $existingClassContent['id'])
                            ->update($updateData);
                    } else {
                        $classContentTable->insert($classContentData);