app/Models/V1/BatchModel.php

SELECT `branch_name`
FROM `school`
WHERE `school_id` = '2'
---
    public function corporateDetail($schoolId): array
    {
        $builder = $this->db->table('school');
        $builder->select('branch_name');
        $builder->where('school_id', $schoolId);

        return $builder->get()->getResultArray();

SELECT CONCAT_WS('/', `cc`.`content_id`, 'content', 342) as value, `c`.`name` as `text`, 0 as `checked`, `cc`.`content_id`, `c`.`content_type`, `c`.`content_format`, 'content' as type, (CASE WHEN cc.batch_id = 342 THEN 1 ELSE 0 END) as delete_status
FROM `classroom_content` `cc`
LEFT JOIN `content` `c` ON `cc`.`content_id` = `c`.`content_id`
WHERE `cc`.`batch_id` = 342
AND `cc`.`status` = 1
AND `c`.`status` = 1
AND `c`.`school_id` = '2'
ORDER BY `c`.`name` ASC
---
    public function getBatchContent(int $batchId, array $params): array
    {
        $builder = $this->db->table('classroom_content cc');
        $builder->select("CONCAT_WS('/', cc.content_id, 'content', {$batchId}) as value");
        $builder->select('c.name as text, 0 as checked, cc.content_id, c.content_type, c.content_format');
        $builder->select("'content' as type");
        $builder->select("(CASE WHEN cc.batch_id = {$batchId} THEN 1 ELSE 0 END) as delete_status");
        $builder->join('content c', 'cc.content_id = c.content_id', 'left');
        $builder->where('cc.batch_id', $batchId);
        $builder->where('cc.status', 1);
        $builder->where('c.status', 1);

        if (isset($params['school_id'])) {
            $builder->where('c.school_id', $params['school_id']);
        }

        $builder->orderBy('c.name', 'ASC');

        return $builder->get()->getResultArray();