app/Models/V1/SubjectModel.php

    public function getSubjects($data)
    {
        $builder = $this->db->table('subject');
        $builder->where('status', 1);
        $builder->orderBy('subject_id', 'ASC');

        $query = $builder->get();
---
SELECT *
FROM `subject`
WHERE `status` = 1
ORDER BY `subject_id` ASC