app/Models/V1/TeacherModel.php

    public function getTeachers($data)
    {
        $builder = $this->db->table('user u');
        $builder->select('u.user_id, u.email_id, up.first_name, up.last_name, u.status,
                         u.school_id, u.role_id, u.login_type, u.created_by, u.created_date');
        $builder->join('user_profile up', 'up.user_id = u.user_id', 'left');
        $builder->where('u.role_id', 4); // Teacher role

        if (isset($data->school_id) && $data->school_id != 0) {
            $builder->where('u.school_id', $data->school_id);
        }

        $builder->where('u.status', 1);
        $builder->orderBy('up.first_name', 'ASC');

        $results = $builder->get()->getResultArray();
---
SELECT `u`.`user_id`, `u`.`email_id`, `up`.`first_name`, `up`.`last_name`, `u`.`status`, `u`.`school_id`, `u`.`role_id`, `u`.`login_type`, `u`.`created_by`, `u`.`created_date`
FROM `user` `u`
LEFT JOIN `user_profile` `up` ON `up`.`user_id` = `u`.`user_id`
WHERE `u`.`role_id` = 4
AND `u`.`school_id` = '2'
AND `u`.`status` = 1
ORDER BY `up`.`first_name` ASC