app/Models/V1/UserModel.php

SELECT `created_date`
FROM `school`
WHERE `school_id` = '2'
SELECT COUNT(*) AS `numrows`
FROM `user` `u`
LEFT JOIN `user_profile_details` `upd` ON `upd`.`user_id` = `u`.`user_id`
WHERE `upd`.`school_id` = '2'
AND `u`.`role_id` = 5
AND `u`.`status` = 1
SELECT DATE_FORMAT(u.created_date, '%b') as monthname, COUNT(*) as student_count
FROM `user` `u`
LEFT JOIN `user_profile_details` `upd` ON `upd`.`user_id` = `u`.`user_id`
WHERE `upd`.`school_id` = '2'
AND `u`.`role_id` = 5
AND `u`.`created_date` >= '2024-10-24'
GROUP BY DATE_FORMAT(u.created_date, '%b')
---
    public function getUserRecords($schoolId)
    {
        $db = \Config\Database::connect();

        // Get school created date
        $schoolBuilder = $db->table('school');
        $schoolBuilder->select('created_date');
        $schoolBuilder->where('school_id', $schoolId);
        $dashboardCount = $schoolBuilder->get()->getResultArray();

        // Get student count (role_id = 5 for students)
        $studentCountResult = $db->table('user u')
            ->join('user_profile_details upd', 'upd.user_id = u.user_id', 'left')
            ->where('upd.school_id', $schoolId)
            ->where('u.role_id', 5)
            ->where('u.status', 1)
            ->countAllResults();
        $schoolCount = [['count' => $studentCountResult]];

        // Get monthly student registrations
        $schoolDataBuilder = $db->table('user u');
        $schoolDataBuilder->select("DATE_FORMAT(u.created_date, '%b') as monthname, COUNT(*) as count");
        $schoolDataBuilder->join('user_profile_details upd', 'upd.user_id = u.user_id', 'left');
        $schoolDataBuilder->where('upd.school_id', $schoolId);
        $schoolDataBuilder->where('u.role_id', 5);
        $schoolDataBuilder->where('u.created_date >=', date('Y-m-d', strtotime('-12 months')));
        $schoolDataBuilder->groupBy("DATE_FORMAT(u.created_date, '%b')");
        $allSchools = $schoolDataBuilder->get()->getResultArray();

SELECT DATE_FORMAT(created_date, '%b') as monthname, COUNT(*) as content
FROM `content`
WHERE `school_id` = '2'
AND `status` = 1
AND `created_date` >= '2025-03-26'
GROUP BY DATE_FORMAT(created_date, '%b')
SELECT COUNT(*) AS `numrows`
FROM `content`
WHERE `school_id` = '2'
AND `status` = 1
---
    public function getContentStatistics($schoolId)
    {
        $db = \Config\Database::connect();

        $builder = $db->table('content');
        $builder->select("DATE_FORMAT(created_date, '%b') as monthname, COUNT(*) as content");
        $builder->where('school_id', $schoolId);
        $builder->where('status', 1);
        $builder->where('created_date >=', date('Y-m-d', strtotime('-7 months')));
        $builder->groupBy("DATE_FORMAT(created_date, '%b')");

        $results = $builder->get()->getResultArray();

        // Calculate percentages
        $totalContent = $db->table('content')
            ->where('school_id', $schoolId)
            ->where('status', 1)
            ->countAllResults();